export const ERROR_MESSAGE = {
	LOGIN: 'Ошибка! Логин может содержать только латинские буквы, цыфры, пробел и знаки: "-", "_"',
	LOGIN_LONG: 'Ошибка! Логин не должен быть более 20 символов!',
	LOGIN_SHORT: 'Ошибка! Логин не должен быть менее 2-х символов!',
	PASSWORD:
		'Ошибка! Пароль может содержать только латинские буквы, цифры и символы: !@#$%^&*+-',
	PASSWORD_LONG: 'Ошибка! Пароль не должен быть более 30 символов!',
	PASSWORD_SHORT: 'Ошибка! Пароль не должен быть менее 7-ми символов!',
	PASSWORD_REPEAT: 'Ошибка! Пароли не совпадают!',
	REG_AUTH_REQUIRED: 'Ошибка! Заполните все поля!',
	NEW_PART_REQUIRED:
		'Ошибка! Заполните все обязательные поля: Артикул, Наименование, Стоимость!',
	NO_USERS_FOUND: 'Ни одного клиента не найдено...',
	ACCESS: 'Доступ запрещён!',
	SERVER_LONG:
		'Сервер не отвечает! Попробуйте перезагрузить страницу. Если ошибка повторится, попробуйте позднее...',
	SERVER_SHORT:
		'Что-то сломалось(((\nСкоро исправим!',
	NON_EXISTENT_PAGE: 'Страница не найдена :`(',
	PRICE_IS_NAN: 'Ошибка! Стоимость заполнена некорректно!',
};
